# Lab 2 - Spark SQL Lab

- Họ và tên: Nguyễn Minh Quang

- MSSV: 22133045

## 1. Thiết lập SQLSession

**Chú ý**: Để thực thi được các đoạn mã kết nối đến Northwind SQLite database ở bên dưới bạn cần đặt file `sqlite-jdbc-3.50.3.0.jar` cùng thư mục với file `.ipynb`.

- Tham khảo: https://spark.apache.org/docs/latest/sql-data-sources-jdbc.html

In [2]:
!pip install findspark

Collecting findspark
  Downloading findspark-2.0.1-py2.py3-none-any.whl.metadata (352 bytes)
Downloading findspark-2.0.1-py2.py3-none-any.whl (4.4 kB)
Installing collected packages: findspark
Successfully installed findspark-2.0.1

In [3]:
import findspark
findspark.init()

import pyspark
findspark.find()

import os
from pyspark.sql import SparkSession

spark = (SparkSession.builder
    .master("local")
    .appName("SQLite JDBC")
    .config(
        "spark.jars",
        "{}/sqlite-jdbc-3.50.3.0.jar".format(os.getcwd()))
    .config(
        "spark.driver.extraClassPath",
        "{}/sqlite-jdbc-3.50.3.0.jar".format(os.getcwd()))
    .getOrCreate())

## 2. Tạo các dataframe từ các table

Ở bài lab này ta sẽ làm việc với CSDL Northwind. Ta sẽ kết nối đến Northwind SQLite database và tạo ra các dataframe từ các table của CSDL này.

Bạn có thể xem lược đồ CSDL Northwind ở hình sau. 

![Northwind Schema](./Northwind.png)

**Chú ý**: **tên bảng và một số thuộc tính** trong hình **không giống hoàn toàn** với CSDL trong file **Northwind.sqlite**.

In [4]:
emp = spark.read.format('jdbc').\
     options(url='jdbc:sqlite:Northwind.sqlite',\
     dbtable='employee',driver='org.sqlite.JDBC').load()

In [5]:
emp.printSchema()

root
 |-- Id: integer (nullable = true)
 |-- LastName: string (nullable = true)
 |-- FirstName: string (nullable = true)
 |-- Title: string (nullable = true)
 |-- TitleOfCourtesy: string (nullable = true)
 |-- BirthDate: string (nullable = true)
 |-- HireDate: string (nullable = true)
 |-- Address: string (nullable = true)
 |-- City: string (nullable = true)
 |-- Region: string (nullable = true)
 |-- PostalCode: string (nullable = true)
 |-- Country: string (nullable = true)
 |-- HomePhone: string (nullable = true)
 |-- Extension: string (nullable = true)
 |-- Photo: binary (nullable = true)
 |-- Notes: string (nullable = true)
 |-- ReportsTo: integer (nullable = true)
 |-- PhotoPath: string (nullable = true)

In [6]:
ord = spark.read.format('jdbc').\
     options(url='jdbc:sqlite:Northwind.sqlite',\
     dbtable='[order]',driver='org.sqlite.JDBC').load()

In [8]:
ord.printSchema()

root
 |-- Id: integer (nullable = true)
 |-- CustomerId: string (nullable = true)
 |-- EmployeeId: integer (nullable = true)
 |-- OrderDate: string (nullable = true)
 |-- RequiredDate: string (nullable = true)
 |-- ShippedDate: string (nullable = true)
 |-- ShipVia: integer (nullable = true)
 |-- Freight: decimal(38,18) (nullable = true)
 |-- ShipName: string (nullable = true)
 |-- ShipAddress: string (nullable = true)
 |-- ShipCity: string (nullable = true)
 |-- ShipRegion: string (nullable = true)
 |-- ShipPostalCode: string (nullable = true)
 |-- ShipCountry: string (nullable = true)

In [9]:
cat = spark.read.format('jdbc').\
     options(url='jdbc:sqlite:Northwind.sqlite',\
     dbtable='category',driver='org.sqlite.JDBC').load()

In [10]:
cat.printSchema()

root
 |-- Id: integer (nullable = true)
 |-- CategoryName: string (nullable = true)
 |-- Description: string (nullable = true)

In [11]:
cus = spark.read.format('jdbc').\
     options(url='jdbc:sqlite:Northwind.sqlite',\
     dbtable='customer',driver='org.sqlite.JDBC').load()

In [15]:
cus.printSchema()

root
 |-- Id: string (nullable = true)
 |-- CompanyName: string (nullable = true)
 |-- ContactName: string (nullable = true)
 |-- ContactTitle: string (nullable = true)
 |-- Address: string (nullable = true)
 |-- City: string (nullable = true)
 |-- Region: string (nullable = true)
 |-- PostalCode: string (nullable = true)
 |-- Country: string (nullable = true)
 |-- Phone: string (nullable = true)
 |-- Fax: string (nullable = true)

In [16]:
od = spark.read.format('jdbc').\
     options(url='jdbc:sqlite:Northwind.sqlite',\
     dbtable='orderdetail',driver='org.sqlite.JDBC').load()

In [17]:
od.printSchema()

root
 |-- Id: string (nullable = true)
 |-- OrderId: integer (nullable = true)
 |-- ProductId: integer (nullable = true)
 |-- UnitPrice: decimal(38,18) (nullable = true)
 |-- Quantity: integer (nullable = true)
 |-- Discount: double (nullable = true)

In [18]:
reg = spark.read.format('jdbc').\
     options(url='jdbc:sqlite:Northwind.sqlite',\
     dbtable='region',driver='org.sqlite.JDBC').load()

In [19]:
reg.printSchema()

root
 |-- Id: integer (nullable = true)
 |-- RegionDescription: string (nullable = true)

In [20]:
sp = spark.read.format('jdbc').\
     options(url='jdbc:sqlite:Northwind.sqlite',\
     dbtable='shipper',driver='org.sqlite.JDBC').load()

In [21]:
sp.printSchema()

root
 |-- Id: integer (nullable = true)
 |-- CompanyName: string (nullable = true)
 |-- Phone: string (nullable = true)

In [22]:
sup = spark.read.format('jdbc').\
     options(url='jdbc:sqlite:Northwind.sqlite',\
     dbtable='supplier',driver='org.sqlite.JDBC').load()

In [23]:
sup.printSchema()

root
 |-- Id: integer (nullable = true)
 |-- CompanyName: string (nullable = true)
 |-- ContactName: string (nullable = true)
 |-- ContactTitle: string (nullable = true)
 |-- Address: string (nullable = true)
 |-- City: string (nullable = true)
 |-- Region: string (nullable = true)
 |-- PostalCode: string (nullable = true)
 |-- Country: string (nullable = true)
 |-- Phone: string (nullable = true)
 |-- Fax: string (nullable = true)
 |-- HomePage: string (nullable = true)

In [24]:
ter = spark.read.format('jdbc').\
     options(url='jdbc:sqlite:Northwind.sqlite',\
     dbtable='territory',driver='org.sqlite.JDBC').load()

In [25]:
ter.printSchema()

root
 |-- Id: string (nullable = true)
 |-- TerritoryDescription: string (nullable = true)
 |-- RegionId: integer (nullable = true)

In [26]:
empter = spark.read.format('jdbc').\
     options(url='jdbc:sqlite:Northwind.sqlite',\
     dbtable='employeeterritory',driver='org.sqlite.JDBC').load()

In [27]:
empter.printSchema()

root
 |-- Id: string (nullable = true)
 |-- EmployeeId: integer (nullable = true)
 |-- TerritoryId: string (nullable = true)

In [28]:
prod = spark.read.format('jdbc').\
     options(url='jdbc:sqlite:Northwind.sqlite',\
     dbtable='product',driver='org.sqlite.JDBC').load()

In [30]:
prod.printSchema()

root
 |-- Id: integer (nullable = true)
 |-- ProductName: string (nullable = true)
 |-- SupplierId: integer (nullable = true)
 |-- CategoryId: integer (nullable = true)
 |-- QuantityPerUnit: string (nullable = true)
 |-- UnitPrice: decimal(38,18) (nullable = true)
 |-- UnitsInStock: integer (nullable = true)
 |-- UnitsOnOrder: integer (nullable = true)
 |-- ReorderLevel: integer (nullable = true)
 |-- Discontinued: integer (nullable = true)

## 3. Tạo các temp view cho các dataframe

In [31]:
cat.createOrReplaceTempView("category")
cus.createOrReplaceTempView("customer")
emp.createOrReplaceTempView("employee")
empter.createOrReplaceTempView("employeeterritory")
ord.createOrReplaceTempView("order")
od.createOrReplaceTempView("orderdetail")
prod.createOrReplaceTempView("product")
reg.createOrReplaceTempView("region")
sp.createOrReplaceTempView("shipper")
sup.createOrReplaceTempView("supplier")
ter.createOrReplaceTempView("territory")

## 4. Xem vài dòng đầu của các table

In [32]:
query = """ 
    select *
    from category
"""
spark.sql(query).show(n=5, truncate=10)

+---+------------+-----------+
| Id|CategoryName|Description|
+---+------------+-----------+
|  1|   Beverages| Soft dr...|
|  2|  Condiments| Sweet a...|
|  3|  Confect...| Dessert...|
|  4|  Dairy P...|    Cheeses|
|  5|  Grains/...| Breads,...|
+---+------------+-----------+
only showing top 5 rows

In [33]:
query = """ 
    select *
    from customer
"""
spark.sql(query).show(n=5, truncate=10)

+-----+-----------+-----------+------------+----------+----------+----------+----------+-------+----------+----------+
|   Id|CompanyName|ContactName|ContactTitle|   Address|      City|    Region|PostalCode|Country|     Phone|       Fax|
+-----+-----------+-----------+------------+----------+----------+----------+----------+-------+----------+----------+
|ALFKI| Alfreds...| Maria A...|  Sales R...|Obere S...|    Berlin|Western...|     12209|Germany|030-007...|030-007...|
|ANATR| Ana Tru...| Ana Tru...|       Owner|Avda. d...|México ...|Central...|     05021| Mexico|(5) 555...|(5) 555...|
|ANTON| Antonio...| Antonio...|       Owner|Matader...|México ...|Central...|     05023| Mexico|(5) 555...|      NULL|
|AROUT| Around ...| Thomas ...|  Sales R...|120 Han...|    London|British...|   WA1 1DP|     UK|(171) 5...|(171) 5...|
|BERGS| Berglun...| Christi...|  Order A...|Berguvs...|     Luleå|Norther...|  S-958 22| Sweden|0921-12...|0921-12...|
+-----+-----------+-----------+------------+----------+----------+----------+----------+-------+----------+----------+
only showing top 5 rows

In [49]:
query = """ 
    select *
    from employee
"""
spark.sql(query).show(n=5, truncate=10)

+---+---------+---------+----------+---------------+----------+----------+----------+--------+----------+----------+-------+----------+---------+-----+----------+---------+----------+
| Id| LastName|FirstName|     Title|TitleOfCourtesy| BirthDate|  HireDate|   Address|    City|    Region|PostalCode|Country| HomePhone|Extension|Photo|     Notes|ReportsTo| PhotoPath|
+---+---------+---------+----------+---------------+----------+----------+----------+--------+----------+----------+-------+----------+---------+-----+----------+---------+----------+
|  1|  Davolio|    Nancy|Sales R...|            Ms.|1980-12-08|2024-05-01|507 - 2...| Seattle|North A...|     98122|    USA|(206) 5...|     5467| NULL|Educati...|        2|http://...|
|  2|   Fuller|   Andrew|Vice Pr...|            Dr.|1984-02-19|2024-08-14|908 W. ...|  Tacoma|North A...|     98401|    USA|(206) 5...|     3457| NULL|Andrew ...|     NULL|http://...|
|  3|Leverling|    Janet|Sales R...|            Ms.|1995-08-30|2024-04-01|722 Mos...|Kirkland|North A...|     98033|    USA|(206) 5...|     3355| NULL|Janet h...|        2|http://...|
|  4|  Peacock| Margaret|Sales R...|           Mrs.|1969-09-19|2025-05-03|4110 Ol...| Redmond|North A...|     98052|    USA|(206) 5...|     5176| NULL|Margare...|        2|http://...|
|  5| Buchanan|   Steven|Sales M...|            Mr.|1987-03-04|2025-10-17|14 Garr...|  London|British...|   SW1 8JR|     UK|(71) 55...|     3453| NULL|Steven ...|        2|http://...|
+---+---------+---------+----------+---------------+----------+----------+----------+--------+----------+----------+-------+----------+---------+-----+----------+---------+----------+
only showing top 5 rows

In [36]:
query = """ 
    select *
    from employeeterritory
"""
spark.sql(query).show(n=5, truncate=10)

+-------+----------+-----------+
|     Id|EmployeeId|TerritoryId|
+-------+----------+-----------+
|1/06897|         1|      06897|
|1/19713|         1|      19713|
|2/01581|         2|      01581|
|2/01730|         2|      01730|
|2/01833|         2|      01833|
+-------+----------+-----------+
only showing top 5 rows

In [38]:
query = """ 
    select *
    from order
"""
spark.sql(query).show(n=5, truncate=10)

+-----+----------+----------+----------+------------+-----------+-------+----------+----------+-----------+----------+----------+--------------+-----------+
|   Id|CustomerId|EmployeeId| OrderDate|RequiredDate|ShippedDate|ShipVia|   Freight|  ShipName|ShipAddress|  ShipCity|ShipRegion|ShipPostalCode|ShipCountry|
+-----+----------+----------+----------+------------+-----------+-------+----------+----------+-----------+----------+----------+--------------+-----------+
|10248|     VINET|         5|2012-07-04|  2012-08-01| 2012-07-16|      3|32.3800...|Vins et...| 59 rue ...|     Reims|Western...|         51100|     France|
|10249|     TOMSP|         6|2012-07-05|  2012-08-16| 2012-07-10|      1|11.6100...|Toms Sp...| Luisens...|   Münster|Western...|         44087|    Germany|
|10250|     HANAR|         4|2012-07-08|  2012-08-05| 2012-07-12|      2|65.8300...|Hanari ...| Rua do ...|Rio de ...|South A...|     05454-876|     Brazil|
|10251|     VICTE|         3|2012-07-08|  2012-08-05| 2012-07-15|      1|41.3400...|Victuai...| 2, rue ...|      Lyon|Western...|         69004|     France|
|10252|     SUPRD|         4|2012-07-09|  2012-08-06| 2012-07-11|      2|51.3000...|Suprême...| Bouleva...| Charleroi|Western...|        B-6000|    Belgium|
+-----+----------+----------+----------+------------+-----------+-------+----------+----------+-----------+----------+----------+--------------+-----------+
only showing top 5 rows

In [39]:
query = """ 
    select *
    from orderdetail
"""
spark.sql(query).show(n=5, truncate=10)

+--------+-------+---------+----------+--------+--------+
|      Id|OrderId|ProductId| UnitPrice|Quantity|Discount|
+--------+-------+---------+----------+--------+--------+
|10248/11|  10248|       11|14.0000...|      12|     0.0|
|10248/42|  10248|       42|9.80000...|      10|     0.0|
|10248/72|  10248|       72|34.8000...|       5|     0.0|
|10249/14|  10249|       14|18.6000...|       9|     0.0|
|10249/51|  10249|       51|42.4000...|      40|     0.0|
+--------+-------+---------+----------+--------+--------+
only showing top 5 rows

In [40]:
query = """ 
    select *
    from product
"""
spark.sql(query).show(n=5, truncate=10)

+---+-----------+----------+----------+---------------+----------+------------+------------+------------+------------+
| Id|ProductName|SupplierId|CategoryId|QuantityPerUnit| UnitPrice|UnitsInStock|UnitsOnOrder|ReorderLevel|Discontinued|
+---+-----------+----------+----------+---------------+----------+------------+------------+------------+------------+
|  1|       Chai|         1|         1|     10 boxe...|18.0000...|          39|           0|          10|           0|
|  2|      Chang|         1|         1|     24 - 12...|19.0000...|          17|          40|          25|           0|
|  3| Aniseed...|         1|         2|     12 - 55...|10.0000...|          13|          70|          25|           0|
|  4| Chef An...|         2|         2|     48 - 6 ...|22.0000...|          53|           0|           0|           0|
|  5| Chef An...|         2|         2|       36 boxes|21.3500...|           0|           0|           0|           1|
+---+-----------+----------+----------+---------------+----------+------------+------------+------------+------------+
only showing top 5 rows

In [41]:
query = """ 
    select *
    from region
"""
spark.sql(query).show(n=5, truncate=10)

+---+-----------------+
| Id|RegionDescription|
+---+-----------------+
|  1|          Eastern|
|  2|          Western|
|  3|         Northern|
|  4|         Southern|
+---+-----------------+

In [42]:
query = """ 
    select *
    from shipper
"""
spark.sql(query).show(n=5, truncate=10)

+---+-----------+----------+
| Id|CompanyName|     Phone|
+---+-----------+----------+
|  1| Speedy ...|(503) 5...|
|  2| United ...|(503) 5...|
|  3| Federal...|(503) 5...|
+---+-----------+----------+

In [43]:
query = """ 
    select *
    from supplier
"""
spark.sql(query).show(n=5, truncate=10)

+---+-----------+-----------+------------+----------+----------+----------+----------+-------+----------+----------+----------+
| Id|CompanyName|ContactName|ContactTitle|   Address|      City|    Region|PostalCode|Country|     Phone|       Fax|  HomePage|
+---+-----------+-----------+------------+----------+----------+----------+----------+-------+----------+----------+----------+
|  1| Exotic ...| Charlot...|  Purchas...|49 Gilb...|    London|British...|   EC1 4SD|     UK|(171) 5...|      NULL|      NULL|
|  2| New Orl...| Shelley...|  Order A...|P.O. Bo...|New Orl...|North A...|     70117|    USA|(100) 5...|      NULL|#CAJUN....|
|  3| Grandma...| Regina ...|  Sales R...|707 Oxf...| Ann Arbor|North A...|     48104|    USA|(313) 5...|(313) 5...|      NULL|
|  4| Tokyo T...| Yoshi N...|  Marketi...|9-8 Sek...|     Tokyo|Eastern...|       100|  Japan|(03) 35...|      NULL|      NULL|
|  5| Coopera...| Antonio...|  Export ...|Calle d...|    Oviedo|Souther...|     33007|  Spain|(98) 59...|      NULL|      NULL|
+---+-----------+-----------+------------+----------+----------+----------+----------+-------+----------+----------+----------+
only showing top 5 rows

In [44]:
query = """ 
    select *
    from territory
"""
spark.sql(query).show(n=5, truncate=10)

+-----+--------------------+--------+
|   Id|TerritoryDescription|RegionId|
+-----+--------------------+--------+
|01581|            Westboro|       1|
|01730|             Bedford|       1|
|01833|           Georgetow|       1|
|02116|              Boston|       1|
|02139|           Cambridge|       1|
+-----+--------------------+--------+
only showing top 5 rows

## 5. Câu hỏi

Viết truy vấn SQL để trả lời các câu hỏi sau đồng thời thực thi các truy vấn đó để hiển thị kết quả.

### Q1. Liệt kê `name`, `address`, `city`, và `region` của các `employee` sống ở `'USA'`.

In [52]:
query = '''
    SELECT 
        concat(LastName, FirstName) as name,
        Address as address,
        City as city,
        Region as region 
    FROM
        Employee
    where
        Country = 'USA'
'''

spark.sql(query).show()

+---------------+--------------------+--------+-------------+
|           name|             address|    city|       region|
+---------------+--------------------+--------+-------------+
|   DavolioNancy|507 - 20th Ave. E...| Seattle|North America|
|   FullerAndrew|  908 W. Capital Way|  Tacoma|North America|
| LeverlingJanet|  722 Moss Bay Blvd.|Kirkland|North America|
|PeacockMargaret|4110 Old Redmond Rd.| Redmond|North America|
|  CallahanLaura|4726 - 11th Ave. ...| Seattle|North America|
+---------------+--------------------+--------+-------------+

### Q2. Liệt kê `title` và `name` của các `employee` đã bán ít nhất một `product` có tên `'Gravad Lax'` hoặc `'Mishi Kobe Niku'`.

In [66]:
query = '''

    WITH product_orders AS (
        SELECT 
            p.ProductName,
            o.EmployeeId,
            o.Id
        FROM
            product p
        JOIN
            orderdetail od ON p.Id = od.ProductId
        JOIN
            order o ON od.OrderId = o.Id
    ), 
    group_emp as (
        select 
            po.EmployeeId
        from 
            product_orders po
        where po.ProductName = 'Gravad Lax' or po.ProductName = 'Mishi Kobe Niku'
        group by po.EmployeeId
        having count(*) > 0
    ), 
    employee_info as (
        select 
            Title,
            concat(FirstName, LastName) as name
        from 
            group_emp ge
            join 
            employee e
                on ge.EmployeeId = e.Id
    )
    SELECT 
        * 
    FROM
        employee_info
        
'''

spark.sql(query).show()

+--------------------+--------------+
|               Title|          name|
+--------------------+--------------+
|Sales Representative|JanetLeverling|
|Sales Representative| AnneDodsworth|
|Sales Representative|    RobertKing|
|Vice President, S...|  AndrewFuller|
+--------------------+--------------+

### Q3. Liệt kê `name` và `title` của các `employee` và `name` và `title` của các `employee` khác mà họ phải báo cáo (`ReportsTo`) (hoặc `null` nếu họ không phải báo cáo với ai).

In [67]:
query = '''
    SELECT e.FirstName || ' ' || e.LastName AS EmployeeName, e.Title AS EmployeeTitle,
        m.FirstName || ' ' || m.LastName AS ManagerName, m.Title AS ManagerTitle
    FROM employee e
    LEFT JOIN employee m ON e.ReportsTo = m.Id;
'''

spark.sql(query).show()

+----------------+--------------------+---------------+--------------------+
|    EmployeeName|       EmployeeTitle|    ManagerName|        ManagerTitle|
+----------------+--------------------+---------------+--------------------+
|   Andrew Fuller|Vice President, S...|           NULL|                NULL|
|  Michael Suyama|Sales Representative|Steven Buchanan|       Sales Manager|
|     Robert King|Sales Representative|Steven Buchanan|       Sales Manager|
|  Anne Dodsworth|Sales Representative|Steven Buchanan|       Sales Manager|
|   Nancy Davolio|Sales Representative|  Andrew Fuller|Vice President, S...|
| Janet Leverling|Sales Representative|  Andrew Fuller|Vice President, S...|
|Margaret Peacock|Sales Representative|  Andrew Fuller|Vice President, S...|
| Steven Buchanan|       Sales Manager|  Andrew Fuller|Vice President, S...|
|  Laura Callahan|Inside Sales Coor...|  Andrew Fuller|Vice President, S...|
+----------------+--------------------+---------------+--------------------+

### Q4. Liệt kê `customer name`, `product name` và `supplier name` cho các `customer` sống ở `'London'` và các `supplier` có tên `'Pavlova, Ltd.'` hoặc `'Karkki Oy'`.

In [68]:
query = '''
    SELECT c.CompanyName AS CustomerName, p.ProductName, s.CompanyName AS SupplierName
    FROM customer c
    JOIN order o ON c.Id = o.CustomerId
    JOIN orderdetail od ON o.Id = od.OrderId
    JOIN product p ON od.ProductId = p.Id
    JOIN supplier s ON p.SupplierId = s.Id
    WHERE c.City = 'London' AND s.CompanyName IN ('Pavlova, Ltd.', 'Karkki Oy');
'''

spark.sql(query).show()

+------------------+----------------+-------------+
|      CustomerName|     ProductName| SupplierName|
+------------------+----------------+-------------+
|Seven Seas Imports|    Alice Mutton|Pavlova, Ltd.|
|Seven Seas Imports|         Pavlova|Pavlova, Ltd.|
|   Around the Horn|   Outback Lager|Pavlova, Ltd.|
|   Around the Horn|   Outback Lager|Pavlova, Ltd.|
|       North/South|   Outback Lager|Pavlova, Ltd.|
|       North/South|   Outback Lager|Pavlova, Ltd.|
|     B's Beverages|   Outback Lager|Pavlova, Ltd.|
|Seven Seas Imports|        Maxilaku|    Karkki Oy|
|Eastern Connection|        Maxilaku|    Karkki Oy|
|   Around the Horn|Valkoinen suklaa|    Karkki Oy|
|   Around the Horn|Valkoinen suklaa|    Karkki Oy|
|     B's Beverages|        Maxilaku|    Karkki Oy|
+------------------+----------------+-------------+

### Q5. Liệt kê `name` của các `employee` có tuổi lớn hơn **một `employee` nào đó** sống ở `'London'`.

In [74]:
query = '''
    SELECT FirstName, LastName
    FROM employee
    WHERE BirthDate < (
        SELECT Max(BirthDate)
        FROM employee
        WHERE City = 'London'
    );
'''

spark.sql(query).show()

+---------+---------+
|FirstName| LastName|
+---------+---------+
|    Nancy|  Davolio|
|   Andrew|   Fuller|
|    Janet|Leverling|
| Margaret|  Peacock|
|   Steven| Buchanan|
|  Michael|   Suyama|
|   Robert|     King|
|    Laura| Callahan|
+---------+---------+

### Q6. Liệt kê `name` của các `employee` có tuổi lớn hơn **tất cả** `employee` sống ở `'London'`.

In [73]:
query = '''
    SELECT FirstName, LastName
    FROM employee
    WHERE BirthDate < (
        SELECT Min(BirthDate)
        FROM employee
        WHERE City = 'London'
    );
'''

spark.sql(query).show()

+---------+--------+
|FirstName|LastName|
+---------+--------+
|    Nancy| Davolio|
|   Andrew|  Fuller|
| Margaret| Peacock|
+---------+--------+

### Q7. Liệt kê `name` của các `employee` làm việc lâu năm hơn **tất cả** `employee` ở `'London'`.

In [76]:
query = '''
    SELECT FirstName, LastName
    FROM employee e
    WHERE e.HireDate < (
        SELECT MIN(e2.HireDate)
        FROM employee e2
        WHERE e2.City = 'London'
    );
'''

spark.sql(query).show()

+---------+---------+
|FirstName| LastName|
+---------+---------+
|    Nancy|  Davolio|
|   Andrew|   Fuller|
|    Janet|Leverling|
| Margaret|  Peacock|
+---------+---------+

### Q8. Liệt kê name của các `employee` và `city` nơi họ sống đối với các `employee` đã bán hàng cho các `customer` ở cùng thành phố với họ.

In [77]:
query = '''
    SELECT e.FirstName || ' ' || e.LastName AS EmployeeName, e.City
    FROM employee e
    JOIN order o ON e.Id = o.EmployeeId
    JOIN customer c ON o.CustomerId = c.Id
    WHERE e.City = c.City;
'''

spark.sql(query).show()

+---------------+-------+
|   EmployeeName|   City|
+---------------+-------+
|  Nancy Davolio|Seattle|
| Laura Callahan|Seattle|
| Laura Callahan|Seattle|
| Michael Suyama| London|
| Anne Dodsworth| London|
| Anne Dodsworth| London|
|    Robert King| London|
|    Robert King| London|
|Steven Buchanan| London|
|Steven Buchanan| London|
| Michael Suyama| London|
|    Robert King| London|
| Michael Suyama| London|
| Michael Suyama| London|
|    Robert King| London|
| Anne Dodsworth| London|
|    Robert King| London|
+---------------+-------+

### Q9. Liệt kê `name` của các `customer` không đặt bất cứ `product` nào.

In [78]:
query = '''
    SELECT ContactName
    FROM customer
    WHERE Id NOT IN (
        SELECT DISTINCT CustomerId
        FROM order
    );
'''

spark.sql(query).show()

+--------------+
|   ContactName|
+--------------+
|Antonio Moreno|
|Janine Labrune|
|    Diego Roel|
|Yvonne Moncada|
|Marie Bertrand|
|Lúcia Carvalho|
+--------------+

### Q10. Liệt kê `name` của các `category` và giá trung bình (`average price`) của các `product` trong mỗi `category`.

In [79]:
query = '''
    SELECT cat.CategoryName, AVG(p.UnitPrice) AS AvgUnitPrice
    FROM category cat
    JOIN product p ON cat.Id = p.CategoryId
    GROUP BY cat.CategoryName;
'''

spark.sql(query).show()

+--------------+--------------------+
|  CategoryName|        AvgUnitPrice|
+--------------+--------------------+
|Dairy Products|28.73000000000000...|
|  Meat/Poultry|54.00666666666666...|
|    Condiments|23.06250000000000...|
|     Beverages|37.97916666666666...|
|Grains/Cereals|20.25000000000000...|
|       Seafood|20.68250000000000...|
|   Confections|25.16000000000000...|
|       Produce|32.37000000000000...|
+--------------+--------------------+

### Q11. Liệt kê `id` và `name` của các `supplier` cung cấp hơn 3 `product`.

In [80]:
query = '''
    SELECT s.Id, s.CompanyName
    FROM supplier s
    JOIN product p ON s.Id = p.SupplierId
    GROUP BY s.Id, s.CompanyName
    HAVING COUNT(p.Id) > 3;
'''

spark.sql(query).show()

+---+--------------------+
| Id|         CompanyName|
+---+--------------------+
|  2|New Orleans Cajun...|
|  7|       Pavlova, Ltd.|
|  8|Specialty Biscuit...|
| 12|Plutzer Lebensmit...|
+---+--------------------+

### Q12. Liệt kê `id`, `name`, và `số lượng order` của các `employee` sắp xếp theo `employee id`.

In [82]:
query = '''
    SELECT e.Id, e.FirstName, e.LastName, COUNT(o.Id) AS OrderNum
    FROM employee e
    JOIN order o ON e.Id = o.EmployeeId
    GROUP BY e.Id, e.FirstName, e.LastName
    ORDER BY e.Id;
'''

spark.sql(query).show()

+---+---------+---------+--------+
| Id|FirstName| LastName|OrderNum|
+---+---------+---------+--------+
|  1|    Nancy|  Davolio|     123|
|  2|   Andrew|   Fuller|      96|
|  3|    Janet|Leverling|     127|
|  4| Margaret|  Peacock|     156|
|  5|   Steven| Buchanan|      42|
|  6|  Michael|   Suyama|      67|
|  7|   Robert|     King|      72|
|  8|    Laura| Callahan|     104|
|  9|     Anne|Dodsworth|      43|
+---+---------+---------+--------+

### Q13. Với mỗi `employee`, liệt kê `id`, `name`, và `số loại product` khác nhau họ đã bán, sắp xếp `employee id`.

In [84]:
query = '''
    SELECT e.Id, e.FirstName, e.LastName, COUNT(DISTINCT od.ProductId) AS ProductNum
    FROM employee e
    JOIN order o ON e.Id = o.EmployeeId
    JOIN orderdetail od ON o.Id = od.OrderId
    GROUP BY e.Id, e.FirstName, e.LastName
    ORDER BY e.Id;
'''

spark.sql(query).show()

+---+---------+---------+----------+
| Id|FirstName| LastName|ProductNum|
+---+---------+---------+----------+
|  1|    Nancy|  Davolio|        72|
|  2|   Andrew|   Fuller|        68|
|  3|    Janet|Leverling|        74|
|  4| Margaret|  Peacock|        75|
|  5|   Steven| Buchanan|        52|
|  6|  Michael|   Suyama|        57|
|  7|   Robert|     King|        67|
|  8|    Laura| Callahan|        70|
|  9|     Anne|Dodsworth|        53|
+---+---------+---------+----------+

### Q14. Liệt kê `id`, `name`, và `tổng doanh thu` (sau khi trừ đi chiết khấu - `Discount`) của mỗi `employee`, sắp xếp theo `employee id`.

In [85]:
query = '''
    SELECT e.Id, e.FirstName, e.LastName, SUM(od.Quantity * od.UnitPrice * (1 - od.Discount)) AS TotalSales
    FROM employee e
    JOIN order o ON e.Id = o.EmployeeId
    JOIN orderdetail od ON o.Id = od.OrderId
    GROUP BY e.Id, e.FirstName, e.LastName
    ORDER BY e.Id;
'''

spark.sql(query).show()

+---+---------+---------+------------------+
| Id|FirstName| LastName|        TotalSales|
+---+---------+---------+------------------+
|  1|    Nancy|  Davolio|192107.60449999993|
|  2|   Andrew|   Fuller|        166537.755|
|  3|    Janet|Leverling|        202812.843|
|  4| Margaret|  Peacock|232890.84599999996|
|  5|   Steven| Buchanan|        68792.2825|
|  6|  Michael|   Suyama|        73913.1295|
|  7|   Robert|     King|        124568.235|
|  8|    Laura| Callahan|126862.27750000004|
|  9|     Anne|Dodsworth|        77308.0665|
+---+---------+---------+------------------+

### Q15. Liệt kê `id`, `name`, và `tổng doanh thu` (có trừ đi chiết khấu - `Discount`) của các `employee` đã bán được hơn `70` `product` khác nhau, sắp xếp theo `employee id`.

In [86]:
query = '''
    SELECT e.Id, e.FirstName, e.LastName, SUM(od.Quantity * od.UnitPrice * (1 - od.Discount)) AS TotalSales
    FROM employee e
    JOIN order o ON e.Id = o.EmployeeId
    JOIN orderdetail od ON o.Id = od.OrderId
    GROUP BY e.Id, e.FirstName, e.LastName
    HAVING COUNT(DISTINCT od.ProductId) > 70
    ORDER BY e.Id;
'''

spark.sql(query).show()

+---+---------+---------+------------------+
| Id|FirstName| LastName|        TotalSales|
+---+---------+---------+------------------+
|  1|    Nancy|  Davolio|192107.60449999996|
|  3|    Janet|Leverling|202812.84300000005|
|  4| Margaret|  Peacock|232890.84599999993|
+---+---------+---------+------------------+

### Q16. Liệt kê `name` của các `employee` đã bán các `product` của hơn `28` `supplier`.

In [87]:
query = '''
    SELECT e.FirstName, e.LastName
    FROM employee e
    JOIN order o ON e.Id = o.EmployeeId
    JOIN orderdetail od ON o.Id = od.OrderId
    JOIN product p ON od.ProductId = p.Id
    GROUP BY e.Id, e.FirstName, e.LastName
    HAVING COUNT(DISTINCT p.SupplierId) > 28;
'''

spark.sql(query).show()

+---------+---------+
|FirstName| LastName|
+---------+---------+
|    Laura| Callahan|
|    Janet|Leverling|
|   Steven| Buchanan|
|   Robert|     King|
| Margaret|  Peacock|
|   Andrew|   Fuller|
|    Nancy|  Davolio|
+---------+---------+

### Q17. Liệt kê `customer name` và `product name` sao cho `số lượng product` đó được mua bởi `customer` đó trong một `order` lớn hơn `5` lần `số lượng trung bình` `product` đó được mua trong một `order` bởi **tất cả** các `customer`.

In [88]:
query = '''
    SELECT c.ContactName, p.ProductName
    FROM customer c
    JOIN order o ON c.Id = o.CustomerId
    JOIN orderdetail od ON o.Id = od.OrderId
    JOIN product p ON od.ProductId = p.Id
    WHERE od.Quantity > 5 * (
        SELECT AVG(Quantity)
        FROM orderdetail
        WHERE ProductId = od.ProductId
    );
'''

spark.sql(query).show()

+--------------+--------------------+
|   ContactName|         ProductName|
+--------------+--------------------+
| Roland Mendel|Wimmers gute Semm...|
| Roland Mendel|Manjimup Dried Ap...|
|Jose Pavarotti|Jack's New Englan...|
+--------------+--------------------+

### Q18. Liệt kê `name` của các `customer` đã mua **tất cả** `product` với giá `< 5`.

In [94]:
query = '''
    WITH ProductsLessThan5 AS (
        SELECT p.Id AS ProductId
        FROM product p
        WHERE p.UnitPrice < 5
    )
    SELECT c.ContactName
    FROM customer c
    LEFT JOIN order o ON o.CustomerId = c.Id
    LEFT JOIN orderdetail od ON o.Id = od.OrderId
    LEFT JOIN ProductsLessThan5 pl5 ON od.ProductId = pl5.ProductId
    GROUP BY c.ContactName
    HAVING COUNT(pl5.ProductId) = (SELECT COUNT(*) FROM ProductsLessThan5);
'''

spark.sql(query).show()

+------------------+
|       ContactName|
+------------------+
|      Mario Pontes|
|    Karl Jablonski|
|   Maurizio Moroni|
|     Peter Franken|
|     Philip Cramer|
|  Giovanni Rovelli|
|       Palle Ibsen|
|  Pascale Cartrain|
|Christina Berglund|
|  Jonas Bergulfsen|
|       Horst Kloss|
+------------------+

### Q19. Liệt kê `name` của các `product` được bán bởi **mọi** `employee`.

In [95]:
query = '''
    SELECT p.ProductName
    FROM product p
    WHERE NOT EXISTS (
        SELECT 1
        FROM employee e
        LEFT JOIN order o ON o.EmployeeId = e.Id
        LEFT JOIN orderdetail od ON o.Id = od.OrderId
        WHERE od.ProductId = p.Id AND o.EmployeeId IS NULL
    );
'''

spark.sql(query).show()

+--------------------+
|         ProductName|
+--------------------+
|   Gorgonzola Telino|
|Louisiana Fiery H...|
|       Perth Pasties|
|       Sasquatch Ale|
|   Rössle Sauerkraut|
|        Lakkalikööri|
| Gumbär Gummibärchen|
|  Schoggi Schokolade|
|        Gula Malacca|
|Queso Manchego La...|
| Gustaf's Knäckebröd|
|       Zaanse koeken|
|                Chai|
|            Filo Mix|
|               Konbu|
|Grandma's Boysenb...|
|             Pavlova|
|       Aniseed Syrup|
|Sir Rodney's Marm...|
|    Boston Crab Meat|
+--------------------+
only showing top 20 rows

### Q20. Liệt kê `name` của các `customer` đã mua **tất cả** các `product` được đặt hàng bởi `customer` có `id` là `'LAZYK'`.

In [98]:
query = '''
    WITH LAZYK_Orders AS (
        SELECT DISTINCT od.ProductId
        FROM order o
        JOIN orderdetail od ON o.Id = od.OrderId
        WHERE o.CustomerId = 'LAZYK'
    )
    SELECT c.ContactName
    FROM customer c
    LEFT JOIN order o ON o.CustomerId = c.Id
    LEFT JOIN orderdetail od ON o.Id = od.OrderId
    LEFT JOIN LAZYK_Orders lz ON od.ProductId = lz.ProductId
    GROUP BY c.ContactName
    HAVING COUNT(DISTINCT lz.ProductId) = (SELECT COUNT(*) FROM LAZYK_Orders);
'''

spark.sql(query).show()

+-------------------+
|        ContactName|
+-------------------+
|     Renate Messner|
|         John Steel|
|   Carlos Hernández|
|Guillermo Fernández|
|   Patricia McKenna|
|      Philip Cramer|
|Henriette Pfalzheim|
|  Elizabeth Lincoln|
|      Roland Mendel|
+-------------------+